In [86]:
import pandas as pd
from sqlalchemy import create_engine

In [87]:
engine = create_engine('postgresql://oluseyi:Vgsadmin23@localhost:5432/c5')

In [88]:
engine.connect()

In [89]:
feb_data_head = pd.read_csv('yellow_tripdata_2016-02.csv',nrows=0)

In [90]:
feb_data_head.to_sql(name='feb_nyc_yellow_taxi',con=engine,if_exists='replace')

0

In [91]:
feb_data = pd.read_csv('yellow_tripdata_2016-02.csv',nrows=100)

In [92]:
feb_data

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RatecodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2016-02-25 17:24:20,2016-02-25 17:27:20,2,0.70,-73.947250,40.763771,1,N,-73.992012,40.735390,2,5.0,0.0,0.5,0.00,0.0,0.3,5.80
1,2,2016-02-25 23:10:50,2016-02-25 23:31:50,2,5.52,-73.983017,40.750992,1,N,-73.988586,40.758839,2,20.0,0.5,0.5,0.00,0.0,0.3,21.30
2,2,2016-02-01 00:00:01,2016-02-01 00:10:52,6,1.99,-73.992340,40.758202,1,N,-73.964355,40.757977,1,9.5,0.5,0.5,0.70,0.0,0.3,11.50
3,1,2016-02-01 00:00:04,2016-02-01 00:05:16,1,1.50,-73.981453,40.749722,1,N,-73.982323,40.763985,2,6.5,0.5,0.5,0.00,0.0,0.3,7.80
4,2,2016-02-01 00:00:05,2016-02-01 00:20:59,1,5.60,-74.000603,40.729755,1,N,-73.951324,40.669834,1,20.0,0.5,0.5,4.00,0.0,0.3,25.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,1,2016-02-01 00:00:29,2016-02-01 00:08:40,1,1.70,-73.977036,40.743099,1,N,-73.992683,40.758530,1,8.5,0.5,0.5,2.45,0.0,0.3,12.25
96,2,2016-02-01 00:00:29,2016-02-01 00:16:23,6,4.09,-73.987091,40.725140,1,N,-73.945717,40.699570,1,15.0,0.5,0.5,4.08,0.0,0.3,20.38
97,2,2016-02-01 00:00:31,2016-02-01 00:13:20,1,2.50,-73.993919,40.735310,1,N,-73.971298,40.758549,1,11.5,0.5,0.5,2.56,0.0,0.3,15.36
98,2,2016-02-01 00:00:31,2016-02-01 00:06:46,1,1.14,-74.004333,40.752644,1,N,-73.993279,40.743122,2,6.5,0.5,0.5,0.00,0.0,0.3,7.80
99,1,2016-02-01 00:00:32,2016-02-01 00:22:17,2,8.40,-74.013306,40.702057,1,N,-73.960526,40.652344,2,25.5,0.5,0.5,0.00,0.0,0.3,26.80

In [93]:
#Load one million data from the yellow_tripdata_2016-02.csv file into our c5 database
from time import time
import pandas as pd
feb_data = pd.read_csv('yellow_tripdata_2016-02.csv',chunksize=100000)
count = 1
while count <= 10:
    t_start = time()                                                                            
    df_feb_data = next(feb_data)
    df_feb_data['tpep_pickup_datetime'] = pd.to_datetime(df_feb_data['tpep_pickup_datetime'])
    df_feb_data['tpep_dropoff_datetime'] = pd.to_datetime(df_feb_data['tpep_dropoff_datetime'])
    df_feb_data.to_sql(name='feb_nyc_yellow_taxi',con=engine,if_exists='append',index=False)
    count +=1
    t_end = time()

    print(f'{count}) loaded a total of {100000*count} records at {t_end - t_start:.3f} seconds')

2) loaded a total of 200000 records at 19.853 seconds
3) loaded a total of 300000 records at 17.687 seconds
4) loaded a total of 400000 records at 17.931 seconds
5) loaded a total of 500000 records at 17.869 seconds
6) loaded a total of 600000 records at 17.827 seconds
7) loaded a total of 700000 records at 17.719 seconds
8) loaded a total of 800000 records at 17.739 seconds
9) loaded a total of 900000 records at 17.742 seconds
10) loaded a total of 1000000 records at 17.664 seconds
11) loaded a total of 1100000 records at 17.710 seconds

In [94]:
pip install --force-reinstall "sqlalchemy<2.0.0"

Collecting sqlalchemy<2.0.0
  Using cached SQLAlchemy-1.4.49-cp310-cp310-win_amd64.whl (1.6 MB)
Collecting greenlet!=0.4.17
  Using cached greenlet-2.0.2-cp310-cp310-win_amd64.whl (192 kB)
Installing collected packages: greenlet, sqlalchemy
  Attempting uninstall: greenlet
    Found existing installation: greenlet 2.0.2
    Uninstalling greenlet-2.0.2:
      Successfully uninstalled greenlet-2.0.2
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.4.49
    Uninstalling SQLAlchemy-1.4.49:
      Successfully uninstalled SQLAlchemy-1.4.49
Note: you may need to restart the kernel to use updated packages.

ERROR: Could not install packages due to an OSError: [WinError 5] Access is denied: 'C:\\Users\\VAS OPERATIONS\\anaconda3\\Lib\\site-packages\\~qlalchemy\\cimmutabledict.cp310-win_amd64.pyd'
Consider using the `--user` option or check the permissions.

In [130]:
import pandas as pd
from sqlalchemy import create_engine

In [96]:
engine = create_engine('postgresql://oluseyi:Vgsadmin23@localhost:5432/c5')
engine.connect()

In [102]:
feb_data_overview = '''
SELECT * FROM feb_nyc_yellow_taxi LIMIT 4

'''
pd.read_sql(feb_data_overview, engine)

,index,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RatecodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,None,2,2016-02-25 17:24:20,2016-02-25 17:27:20,2,0.7,-73.94725036621092,40.763771057128906,1,N,-73.99201202392578,40.735389709472656,2,5.0,0.0,0.5,0.0,0.0,0.3,5.8
1,None,2,2016-02-25 23:10:50,2016-02-25 23:31:50,2,5.52,-73.98301696777342,40.750991821289055,1,N,-73.98858642578125,40.758838653564446,2,20.0,0.5,0.5,0.0,0.0,0.3,21.3
2,None,2,2016-02-01 00:00:01,2016-02-01 00:10:52,6,1.99,-73.99234008789062,40.75820159912109,1,N,-73.96435546875,40.757976531982415,1,9.5,0.5,0.5,0.7,0.0,0.3,11.5
3,None,1,2016-02-01 00:00:04,2016-02-01 00:05:16,1,1.5,-73.98145294189453,40.74972152709961,1,N,-73.9823226928711,40.763984680175774,2,6.5,0.5,0.5,0.0,0.0,0.3,7.8

## operations_and_performance
Utilize the ingested data to build reporting pipelines that generate valuable insights from the NYC Yellow Taxi
dataset yellow_tripdata_2016-02.csv.

In [107]:
#How many trips were recorded in the dataset? 
#Note that the trips(according to the provided dataset) involve both trips that were made(trip distance>0) and those that were not made(trip distance=0)

total_trips = '''
SELECT COUNT(trip_distance) AS total_trips 
from feb_nyc_yellow_taxi
'''

pd.read_sql(total_trips,engine)

   total_trips
0      1000000

In [147]:
#What is the average trip distance for all trips?

avg_trip_distance = '''
SELECT AVG(CAST(trip_distance AS NUMERIC)) AS avg_trip_distance
FROM feb_nyc_yellow_taxi
'''
pd.read_sql(avg_trip_distance,engine)

   avg_trip_distance
0           2.751403

In [109]:
#Which Vendor has the highest number of trips?

highest_trip_vendor = '''
SELECT "VendorID", COUNT(*) AS highest_trip_vendor
FROM feb_nyc_yellow_taxi
GROUP BY "VendorID"
ORDER BY highest_trip_vendor DESC
LIMIT 1
'''
pd.read_sql(highest_trip_vendor,engine)

  VendorID  highest_trip_vendor
0        2               531696

In [110]:
#Which Vendor has the lowest number of trips

lowest_trip_vendor = '''
SELECT "VendorID", COUNT(*) AS lowest_trip_vendor
FROM feb_nyc_yellow_taxi
GROUP BY "VendorID"
ORDER BY lowest_trip_vendor ASC
LIMIT 1
'''
pd.read_sql(lowest_trip_vendor,engine)

  VendorID  lowest_trip_vendor
0        1              468304

In [133]:
#What is the average passenger count per trip?

avg_passenger_count = '''
SELECT AVG(CAST(passenger_count AS NUMERIC)) AS avg_passenger_count
FROM feb_nyc_yellow_taxi
'''
pd.read_sql(avg_passenger_count,engine)

   avg_passenger_count
0             1.631115

## customer_demographics_and_preferences
Utilize the ingested data to build reporting pipelines that generate valuable insights from the NYC Yellow Taxi
dataset yellow_tripdata_2016-02.csv.

In [134]:
#What is the average trip amount given by passengers?

avg_tip_amount = '''
SELECT AVG(CAST(total_amount AS NUMERIC)) AS avg_tip_amount
FROM feb_nyc_yellow_taxi
'''
pd.read_sql(avg_tip_amount,engine)

   avg_tip_amount
0       15.578133

In [135]:
#What is the average trip distance by passengers?

avg_trip_distance_by_passenger = '''
SELECT AVG(CAST(trip_distance AS NUMERIC)) AS avg_trip_distance_by_passenger
FROM feb_nyc_yellow_taxi
WHERE CAST(trip_distance AS NUMERIC) > 0
'''

pd.read_sql(avg_trip_distance_by_passenger,engine)

   avg_trip_distance_by_passenger
0                        2.767276

In [136]:
#How many trips were ﬂagged as 'store and forward

store_and_forward_trips = '''
SELECT COUNT(*) AS store_and_forward_trips
FROM feb_nyc_yellow_taxi
WHERE store_and_fwd_flag = 'Y'
'''
pd.read_sql(store_and_forward_trips,engine)

   store_and_forward_trips
0                     5918

In [138]:
#How many trips were shared rides (passenger count > 1)?

shared_ride_count = '''
SELECT COUNT(*) AS shared_ride_count
FROM feb_nyc_yellow_taxi
WHERE CAST(passenger_count AS INTEGER) > 1

'''
pd.read_sql(shared_ride_count,engine)

   shared_ride_count
0             267128

## financial_performance
Utilize the ingested data to build reporting pipelines that generate valuable insights from the NYC Yellow Taxi
dataset yellow_tripdata_2016-02.csv.

In [140]:
#What is the average fare amount per trip?

avg_fare_amount = '''
Select AVG(CAST(fare_amount AS NUMERIC)) AS avg_fare_amount
from feb_nyc_yellow_taxi
'''

pd.read_sql(avg_fare_amount,engine)

   avg_fare_amount
0        12.343774

In [151]:
# How much revenue was generated from tolls and surcharges combined?

tolls_and_surcharges_revenue = '''
SELECT SUM(CAST(tolls_amount AS NUMERIC) + CAST(improvement_surcharge AS NUMERIC)) AS tolls_and_surcharges_revenue
FROM feb_nyc_yellow_taxi
'''

pd.read_sql(tolls_and_surcharges_revenue,engine)

   tolls_and_surcharges_revenue
0                      598262.8

In [144]:
#What is the average total amount paid by passengers?

avg_total_amount = '''
select AVG(CAST(total_amount AS NUMERIC)) AS avg_total_amount
from feb_nyc_yellow_taxi
'''
pd.read_sql(avg_total_amount,engine)

   avg_total_amount
0         15.578133

# CREATING REPORTING TABLES

#ingestion_date | total_trips | avg_trip_distance |highest_trip_vendor | lowest_trip_vendor | 
avg_passenger_count

In [152]:
report = '''
SELECT CURRENT_DATE AS ingestion_date, * FROM

(SELECT COUNT(trip_distance) AS total_trips 
from feb_nyc_yellow_taxi) AS a,

(SELECT AVG(CAST(trip_distance AS NUMERIC)) AS avg_trip_distance
FROM feb_nyc_yellow_taxi) AS b,

(SELECT "VendorID", COUNT(*) AS highest_trip_vendor
FROM feb_nyc_yellow_taxi
GROUP BY "VendorID"
ORDER BY highest_trip_vendor DESC
LIMIT 1) AS c,

(SELECT "VendorID", COUNT(*) AS lowest_trip_vendor
FROM feb_nyc_yellow_taxi
GROUP BY "VendorID"
ORDER BY lowest_trip_vendor ASC
LIMIT 1) AS d,

(SELECT AVG(CAST(passenger_count AS NUMERIC)) AS avg_passenger_count
FROM feb_nyc_yellow_taxi) AS e,

(SELECT AVG(CAST(total_amount AS NUMERIC)) AS avg_tip_amount
FROM feb_nyc_yellow_taxi) AS f,

(SELECT AVG(CAST(trip_distance AS NUMERIC)) AS avg_trip_distance_by_passenger
FROM feb_nyc_yellow_taxi
WHERE CAST(trip_distance AS NUMERIC) > 0) AS g,

(SELECT COUNT(*) AS store_and_forward_trips
FROM feb_nyc_yellow_taxi
WHERE store_and_fwd_flag = 'Y') AS h,

(SELECT COUNT(*) AS shared_ride_count
FROM feb_nyc_yellow_taxi
WHERE CAST(passenger_count AS INTEGER) > 1) AS i,

(Select AVG(CAST(fare_amount AS NUMERIC)) AS avg_fare_amount
from feb_nyc_yellow_taxi) AS j,

(SELECT SUM(CAST(tolls_amount AS NUMERIC) + CAST(improvement_surcharge AS NUMERIC)) AS tolls_and_surcharges_revenue
FROM feb_nyc_yellow_taxi) AS k,

(select AVG(CAST(total_amount AS NUMERIC)) AS avg_total_amount
from feb_nyc_yellow_taxi) AS l



'''

#pd.read_sql(report,engine)

In [153]:
df_report = pd.read_sql(report,engine)

In [154]:
df_report.to_sql('nyc_reporting_table', con=engine,if_exists='append')

1

# CLEANING UP WITH REUSABLE FUNCTION

In [155]:
def transform_data(query,connection):
    try:
        report_query = pd.read_sql(query,connection)
        print('successfully transformed the data')
        return report_query      
    except:
        print('Encountered error while transforming')

In [156]:
def load_report_to_warehouse(dataframe,table,connection):
    try:
        dataframe.to_sql(table, con=connection,if_exists='append')
        print(f'successfully updated {table} table')
    except:
        print(f'Could not update {table}')

In [157]:
#RUNNING THE ENTIRE PROCESSES
df_report = transform_data(report,engine)
load_report_to_warehouse(df_report,'nyc_reports',engine)

successfully transformed the data
successfully updated nyc_reports table